print("Привет! Это словарь молодёжного сленга.")
print("Я помогу тебе понять значения мемных слов.")
print("Вводи слова БОЛЬШИМИ БУКВАМИ!")
print("-" * 40)


meme_dict = {
            "КРИНЖ": "Что-то очень странное или стыдное",
            "ЛОЛ": "Что-то очень смешное",
            "КРИПОВЫЙ": "страшный, пугающий",
             "АГРИТЬСЯ":"злиться",
            "РОФЛ": "шутка"
            }
for i in range(5):
    word = input("Введите непонятное слово (большими буквами!): ")
    if word in meme_dict.keys():
        print("значение",meme_dict[word]) 
    else:
        print("такое слова нету")
